<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bd8b075f20e9f04413835527fefd33a6eb3ea9417a8c69240af1dc548899264e","plan_job_ref":"Job Create terraform plan #27 at https://github.com/presentium/infrastructure/actions/runs/10288027202","plan_out_hash":"53839b8f9c9363160c5c0b2c5bdb0ae81d4a17fca291766faf15111a1ffbc05b","plan_hash":"777033badf383fd07805946cdd0597ab16b2ed6b3c8295720c6f71601d573112","plan_text_format":"diff","version":"1.44.0","closed":true} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.argocd.null_resource.argocd_apply_once is tainted, so must be replaced
-/+ resource "null_resource" "argocd_apply_once" {
!~      id       = "******************" -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.rds.module.database.aws_rds_cluster.this[0] will be created
+   resource "aws_rds_cluster" "this" {
+       allocated_storage                     = (known after apply)
+       allow_major_version_upgrade           = false
+       apply_immediately                     = true
+       arn                                   = (known after apply)
+       availability_zones                    = (known after apply)
+       backtrack_window                      = 0
+       backup_retention_period               = (known after apply)
+       ca_certificate_identifier             = (known after apply)
+       ca_certificate_valid_till             = (known after apply)
+       cluster_identifier                    = "**********"
+       cluster_identifier_prefix             = (known after apply)
+       cluster_members                       = (known after apply)
+       cluster_resource_id                   = (known after apply)
+       copy_tags_to_snapshot                 = false
+       database_name                         = "presentium"
+       db_cluster_parameter_group_name       = (known after apply)
+       db_subnet_group_name                  = "presentium"
+       db_system_id                          = (known after apply)
+       delete_automated_backups              = true
+       deletion_protection                   = true
+       enable_global_write_forwarding        = false
+       enable_http_endpoint                  = false
+       enable_local_write_forwarding         = false
+       endpoint                              = (known after apply)
+       engine                                = "aurora-postgresql"
+       engine_lifecycle_support              = "open-source-rds-extended-support-disabled"
+       engine_mode                           = "provisioned"
+       engine_version                        = "16.3"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       iam_database_authentication_enabled   = true
+       iam_roles                             = (known after apply)
+       id                                    = (known after apply)
+       kms_key_id                            = (known after apply)
+       manage_master_user_password           = true
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       master_username                       = "root"
+       network_type                          = (known after apply)
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = 5432
+       preferred_backup_window               = "02:00-03:00"
+       preferred_maintenance_window          = "sun:05:00-sun:06:00"
+       reader_endpoint                       = (known after apply)
+       skip_final_snapshot                   = true
+       storage_encrypted                     = true
+       storage_type                          = (known after apply)
+       tags_all                              = {
+           "Terraform" = "true"
        }
+       vpc_security_group_ids                = [
+           "sg-09c40ae88f63c07b5",
        ]

+       serverlessv2_scaling_configuration {
+           max_capacity = 1
+           min_capacity = 1
        }

+       timeouts {}
    }

  # module.rds.module.database.aws_rds_cluster_instance.this["one"] will be created
+   resource "aws_rds_cluster_instance" "this" {
+       apply_immediately                     = true
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       cluster_identifier                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_parameter_group_name               = (known after apply)
+       db_subnet_group_name                  = "presentium"
+       dbi_resource_id                       = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "aurora-postgresql"
+       engine_version                        = "16.3"
+       engine_version_actual                 = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "presentium-one"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.serverless"
+       kms_key_id                            = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       network_type                          = (known after apply)
+       performance_insights_enabled          = (known after apply)
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       preferred_backup_window               = (known after apply)
+       preferred_maintenance_window          = "sun:05:00-sun:06:00"
+       promotion_tier                        = 0
+       publicly_accessible                   = false
+       storage_encrypted                     = (known after apply)
+       tags_all                              = {
+           "Terraform" = "true"
        }
+       writer                                = (known after apply)

+       timeouts {}
    }

  # module.rds.module.database.aws_security_group.this[0] (deposed object c9c179d7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
-   resource "aws_security_group" "this" {
-       arn                    = "arn:aws:ec2:eu-west-1:123247571664:security-group/sg-0b7a1f42a643798ff" -> null
-       description            = "Control traffic to/from RDS Aurora db-presentium" -> null
-       egress                 = [] -> null
-       id                     = "sg-0b7a1f42a643798ff" -> null
-       ingress                = [] -> null
-       name                   = "db-presentium-20240807144642904300000006" -> null
-       name_prefix            = "db-presentium-" -> null
-       owner_id               = "123247571664" -> null
-       revoke_rules_on_delete = false -> null
-       tags                   = {
-           "Name" = "db-presentium"
        } -> null
-       tags_all               = {
-           "Name"      = "db-presentium"
-           "Terraform" = "true"
        } -> null
-       vpc_id                 = "vpc-09efe0e2a62b203e4" -> null
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```
</details>

:x: Error applying plan in [Apply terraform plan #8](https://github.com/presentium/infrastructure/actions/runs/10288055472)